app/Models/MoodModel.php

SELECT *
FROM `mood`
WHERE `user` = 1
---
    public function getMood()
    {
        $user = auth()->user();

        $result = $this->where(['user' => $user->id])->find();